In [83]:
import numpy as np
import pandas as pd
import os

In [84]:
os.getcwd()

'C:\\Users\\macka\\GitHub\\Python-Exercises\\Modulo 2-Numpy'

In [93]:
df_products=pd.read_csv("pill_numpy_products.csv", sep=";", na_values='?');df_products

,Day,Bananas_quantity,Apples_quantity,Oranges_quantity,Total_amount
0,Monday,5,32,16,NaN
1,Tuesday,8,25,14,NaN
2,Wednesday,12,15,15,NaN
3,Thursday,6,36,20,NaN
4,Friday,9,45,21,NaN
5,Saturday,4,22,25,NaN
6,Sunday,7,17,10,NaN

In [96]:
df_price=pd.read_csv("pill_numpy_price.csv", sep=";");df_price

  Unnamed: 0  price
0     Banana      5
1      Apple      3
2     Orange      2

In [98]:
df_price.columns

Index(['Unnamed: 0', 'price'], dtype='object')

In [99]:
df_price.set_index('Unnamed: 0')

            price
Unnamed: 0
Banana          5
Apple           3
Orange          2

In [104]:
df_products.Total_amount=df_price.price[0]*df_products.Bananas_quantity+df_price.price[1]*df_products.Apples_quantity+df_price.price[2]*df_products.Apples_quantity
df_products

,Day,Bananas_quantity,Apples_quantity,Oranges_quantity,Total_amount
0,Monday,5,32,16,185
1,Tuesday,8,25,14,165
2,Wednesday,12,15,15,135
3,Thursday,6,36,20,210
4,Friday,9,45,21,270
5,Saturday,4,22,25,130
6,Sunday,7,17,10,120

DUDA: como se podir ahcer de otra forma, multiplicando fila 1 x colum1

In [3]:
import pandas as pd

df=[1,2,3]
df2=pd.DataFrame(df)

df3=df2*2;print(type(df3))
df3

<class 'pandas.core.frame.DataFrame'>

   0
0  2
1  4
2  6